{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "sequence_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 10002], "dtype": "float32", "sparse": false, "name": "sequence_input"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1, 10002]}, "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda_4", 0, 0, {}]], [["lambda_5", 0, 0, {}]], [["lambda_6", 0, 0, {}]], [["lambda_7", 0, 0, {}]], [["lambda_8", 0, 0, {}]], [["lambda_9", 0, 0, {}]], [["lambda_10", 0, 0, {}]], [["lambda_11", 0, 0, {}]], [["lambda_12", 0, 0, {}]], [["lambda_13", 0, 0, {}]], [["lambda_14", 0, 0, {}]], [["lambda_15", 0, 0, {}]], [["lambda_16", 0, 0, {}]], [["lambda_17", 0, 0, {}]], [["lambda_18", 0, 0, {}]], [["lambda_19", 0, 0, {}]], [["lambda_20", 0, 0, {}]], [["lambda_21", 0, 0, {}]], [["lambda_22", 0, 0, {}]], [["lambda_23", 0, 0, {}]], [["lambda_24", 0, 0, {}]], [["lambda_25", 0, 0, {}]], [["lambda_26", 0, 0, {}]], [["lambda_27", 0, 0, {}]], [["lambda_28", 0, 0, {}]], [["lambda_29", 0, 0, {}]], [["lambda_30", 0, 0, {}]]]}, {"name": "hidden_state_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "name": "hidden_state_0"}, "inbound_nodes": []}, {"name": "cell_state_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "name": "cell_state_0"}, "inbound_nodes": []}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["hidden_state_0", 0, 0, {}], ["cell_state_0", 0, 0, {}]], [["reshape_1", 1, 0, {}], ["lstm_1", 0, 0, {}], ["lstm_1", 0, 2, {}]], [["reshape_1", 2, 0, {}], ["lstm_1", 1, 0, {}], ["lstm_1", 1, 2, {}]], [["reshape_1", 3, 0, {}], ["lstm_1", 2, 0, {}], ["lstm_1", 2, 2, {}]], [["reshape_1", 4, 0, {}], ["lstm_1", 3, 0, {}], ["lstm_1", 3, 2, {}]], [["reshape_1", 5, 0, {}], ["lstm_1", 4, 0, {}], ["lstm_1", 4, 2, {}]], [["reshape_1", 6, 0, {}], ["lstm_1", 5, 0, {}], ["lstm_1", 5, 2, {}]], [["reshape_1", 7, 0, {}], ["lstm_1", 6, 0, {}], ["lstm_1", 6, 2, {}]], [["reshape_1", 8, 0, {}], ["lstm_1", 7, 0, {}], ["lstm_1", 7, 2, {}]], [["reshape_1", 9, 0, {}], ["lstm_1", 8, 0, {}], ["lstm_1", 8, 2, {}]], [["reshape_1", 10, 0, {}], ["lstm_1", 9, 0, {}], ["lstm_1", 9, 2, {}]], [["reshape_1", 11, 0, {}], ["lstm_1", 10, 0, {}], ["lstm_1", 10, 2, {}]], [["reshape_1", 12, 0, {}], ["lstm_1", 11, 0, {}], ["lstm_1", 11, 2, {}]], [["reshape_1", 13, 0, {}], ["lstm_1", 12, 0, {}], ["lstm_1", 12, 2, {}]], [["reshape_1", 14, 0, {}], ["lstm_1", 13, 0, {}], ["lstm_1", 13, 2, {}]], [["reshape_1", 15, 0, {}], ["lstm_1", 14, 0, {}], ["lstm_1", 14, 2, {}]], [["reshape_1", 16, 0, {}], ["lstm_1", 15, 0, {}], ["lstm_1", 15, 2, {}]], [["reshape_1", 17, 0, {}], ["lstm_1", 16, 0, {}], ["lstm_1", 16, 2, {}]], [["reshape_1", 18, 0, {}], ["lstm_1", 17, 0, {}], ["lstm_1", 17, 2, {}]], [["reshape_1", 19, 0, {}], ["lstm_1", 18, 0, {}], ["lstm_1", 18, 2, {}]], [["reshape_1", 20, 0, {}], ["lstm_1", 19, 0, {}], ["lstm_1", 19, 2, {}]], [["reshape_1", 21, 0, {}], ["lstm_1", 20, 0, {}], ["lstm_1", 20, 2, {}]], [["reshape_1", 22, 0, {}], ["lstm_1", 21, 0, {}], ["lstm_1", 21, 2, {}]], [["reshape_1", 23, 0, {}], ["lstm_1", 22, 0, {}], ["lstm_1", 22, 2, {}]], [["reshape_1", 24, 0, {}], ["lstm_1", 23, 0, {}], ["lstm_1", 23, 2, {}]], [["reshape_1", 25, 0, {}], ["lstm_1", 24, 0, {}], ["lstm_1", 24, 2, {}]], [["reshape_1", 26, 0, {}], ["lstm_1", 25, 0, {}], ["lstm_1", 25, 2, {}]], [["reshape_1", 27, 0, {}], ["lstm_1", 26, 0, {}], ["lstm_1", 26, 2, {}]], [["reshape_1", 28, 0, {}], ["lstm_1", 27, 0, {}], ["lstm_1", 27, 2, {}]], [["reshape_1", 29, 0, {}], ["lstm_1", 28, 0, {}], ["lstm_1", 28, 2, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_9", "class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_11", "class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_12", "class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_21", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_22", "class_name": "Lambda", "config": {"name": "lambda_22", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_23", "class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_24", "class_name": "Lambda", "config": {"name": "lambda_24", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_25", "class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_26", "class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_27", "class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_28", "class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_29", "class_name": "Lambda", "config": {"name": "lambda_29", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "lambda_30", "class_name": "Lambda", "config": {"name": "lambda_30", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxYAAAB8AGQAZACFAogAZABkAIUCZgMZAFMAKQFOqQApAdoB\neSkB2gF0cgEAAAD6HjxpcHl0aG9uLWlucHV0LTctM2U5OGFiYWZkNzQzPtoIPGxhbWJkYT4iAAAA\n8wAAAAA=\n", null, [29]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 10002, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]], [["lstm_1", 1, 0, {}]], [["lstm_1", 2, 0, {}]], [["lstm_1", 3, 0, {}]], [["lstm_1", 4, 0, {}]], [["lstm_1", 5, 0, {}]], [["lstm_1", 6, 0, {}]], [["lstm_1", 7, 0, {}]], [["lstm_1", 8, 0, {}]], [["lstm_1", 9, 0, {}]], [["lstm_1", 10, 0, {}]], [["lstm_1", 11, 0, {}]], [["lstm_1", 12, 0, {}]], [["lstm_1", 13, 0, {}]], [["lstm_1", 14, 0, {}]], [["lstm_1", 15, 0, {}]], [["lstm_1", 16, 0, {}]], [["lstm_1", 17, 0, {}]], [["lstm_1", 18, 0, {}]], [["lstm_1", 19, 0, {}]], [["lstm_1", 20, 0, {}]], [["lstm_1", 21, 0, {}]], [["lstm_1", 22, 0, {}]], [["lstm_1", 23, 0, {}]], [["lstm_1", 24, 0, {}]], [["lstm_1", 25, 0, {}]], [["lstm_1", 26, 0, {}]], [["lstm_1", 27, 0, {}]], [["lstm_1", 28, 0, {}]], [["lstm_1", 29, 0, {}]]]}], "input_layers": [["sequence_input", 0, 0], ["hidden_state_0", 0, 0], ["cell_state_0", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_1", 1, 0], ["dense_1", 2, 0], ["dense_1", 3, 0], ["dense_1", 4, 0], ["dense_1", 5, 0], ["dense_1", 6, 0], ["dense_1", 7, 0], ["dense_1", 8, 0], ["dense_1", 9, 0], ["dense_1", 10, 0], ["dense_1", 11, 0], ["dense_1", 12, 0], ["dense_1", 13, 0], ["dense_1", 14, 0], ["dense_1", 15, 0], ["dense_1", 16, 0], ["dense_1", 17, 0], ["dense_1", 18, 0], ["dense_1", 19, 0], ["dense_1", 20, 0], ["dense_1", 21, 0], ["dense_1", 22, 0], ["dense_1", 23, 0], ["dense_1", 24, 0], ["dense_1", 25, 0], ["dense_1", 26, 0], ["dense_1", 27, 0], ["dense_1", 28, 0], ["dense_1", 29, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}